In [92]:
import pandas as pd
import requests

EP = "https://raw.githubusercontent.com/lucas-hub12/nextjs-fastapi-starter/refs/heads/main/endpoints.json"

In [93]:
res = requests.get(EP)

In [3]:
res.status_code

200

In [4]:
res.encoding

'utf-8'

In [5]:
res.text

'{\n    "endpoints": [\n      {"name": "TOM","url": "https://ac.sunsin.shop/api/py/select_all"},\n      {"name": "jiwon","url": "https://agecal.wodan10.shop/api/py/select_all"},\n      {"name": "heejin","url": "https://age.journeyjean.shop/api/py/select_all"}, \n      {"name": "hyun","url": "https://agecalculator.calcalhan.store/api/py/select_all"},\n      {"name": "cho","url": "https://nextjs-fastapi-starter-5j3bemub7-chominkyus-projects.vercel.app/api/py/select_all"},\n      {"name": "jacob","url": "https://jacob0503.vercel.app/api/py/select_table"},\n      {"name": "nuni","url": "https://ac.nunininu.shop/api/py/select_all"},\n      {"name": "lucas","url": "https://ac.lucas12.store/api/py/select_all"},\n      {"name": "SEO","url":"https://ac.seo-sigma.shop/api/py/select_all"},\n      {"name": "JERRY", "url": "https://jooon.vercel.app/api/py/select_all"}\n    ]\n}\n'

In [94]:
data = res.json()

In [95]:
type(data)

dict

In [96]:
endpoints = data['endpoints']
type(endpoints)

list

In [97]:
for p in endpoints:
    print(f'{p["name"]},{p["url"]}')

TOM,https://ac.sunsin.shop/api/py/select_all
jiwon,https://agecal.wodan10.shop/api/py/select_all
heejin,https://age.journeyjean.shop/api/py/select_all
hyun,https://agecalculator.calcalhan.store/api/py/select_all
cho,https://nextjs-fastapi-starter-5j3bemub7-chominkyus-projects.vercel.app/api/py/select_all
jacob,https://jacob0503.vercel.app/api/py/select_table
nuni,https://ac.nunininu.shop/api/py/select_all
lucas,https://ac.lucas12.store/api/py/select_all
SEO,https://ac.seo-sigma.shop/api/py/select_all
JERRY,https://jooon.vercel.app/api/py/select_all

In [10]:
res = requests.get("https://ac.sunsin.shop/api/py/select_all")
# res.status_code
data = res.json()
df_heejin = pd.DataFrame(data)
df_heejin.head(1)

  menu_name name          dt
0       설렁탕  TOM  2025-02-07

In [11]:
res = requests.get("https://ac.lucas12.store/api/py/select_all")
# res.status_code
data = res.json()
df_lucas = pd.DataFrame(data)
df_lucas.head(1)

  menu_name   name          dt
0       순대국  lucas  2025-02-11

In [12]:
res = requests.get("https://age.journeyjean.shop/api/py/select_all")
# res.status_code
data = res.json()
df_jacob = pd.DataFrame(data)
df_jacob.head(1)

  menu_name name          dt
0       컵라면  TOM  2025-02-10

In [18]:
# 나의 df에 없는 row를 찾아서 새로운 df으로 만들기
n_rows = []
for _, row_h in df_jacob.iterrows():
    is_match_row =False
    for _, row_l in df_lucas.iterrows():
        is_match_columns =True
        for col in df_lucas.columns:
            if row_h[col] != row_l[col]:
                is_match_columns = False
                break
        if is_match_columns:
           is_match_row = True

    if is_match_row:
        n_rows.append(row_h)
df_news = pd.DataFrame(n_rows)
df_news

          menu_name    name          dt
11              볶음밥   lucas  2025-01-07
12         일반 짬뽕 보통    nuni  2025-01-07
15              주먹밥   JERRY  2025-01-08
21               규동   lucas  2025-01-08
22         무공 옛날돈가스    nuni  2025-01-08
24          얼큰 순대국밥    hyun  2025-01-09
25          얼큰 순대국밥   JERRY  2025-01-09
31            한우 곰탕   lucas  2025-01-09
32           얼큰 설렁탕    nuni  2025-01-09
35           불닭로제찜닭   JERRY  2025-01-10
39             부대찌개  heejin  2025-01-10
41             부대찌개   lucas  2025-01-10
42             부대찌개    nuni  2025-01-10
44               한솥    hyun  2025-01-13
45               한솥   JERRY  2025-01-13
50          꽃게 된장찌개   lucas  2025-01-13
51      고기김치찌개,라면세트    nuni  2025-01-13
59               한솥   lucas  2025-01-14
60               한솥    nuni  2025-01-14
68     생고기김치찌개,라면사리   lucas  2025-01-15
69            순두부찌개    nuni  2025-01-15
78   비빔국수 , 반 계란 김밥   lucas  2025-01-16
79      반반국수(비빔&잔치)    nuni  2025-01-16
87           안심 돈카츠   lucas  2025-01-17
88        카레 돈카츠 세트    nuni  2025-01-17
97            낙지 볶음   lucas  2025-01-20
98             제육볶음    nuni  2025-01-20
101      고등어구이,제육볶음   JERRY  2025-01-21
102      고등어구이,제육볶음     SEO  2025-01-21
105      얼큰미나리 샤브세트  heejin  2025-01-21
107      얼큰미나리 샤브세트   lucas  2025-01-21
115          햄 김치찌개   lucas  2025-01-22
116          순두부 찌개    nuni  2025-01-22
125           육회비빔밥   lucas  2025-01-23
126           육회비빔밥    nuni  2025-01-23
134          콩나물해장국   lucas  2025-01-24
135         김치찌개,라면    nuni  2025-01-24
144            제육볶음   lucas  2025-02-03
145            제육볶음    nuni  2025-02-03

In [41]:
merge_df = pd.merge(df_jacob, df_lucas, how='right', indicator=True)

In [42]:
merge_df

        menu_name    name          dt      _merge
0             순대국   lucas  2025-02-11  right_only
1             순대국     TOM  2025-01-07  right_only
2             닭개장     cho  2025-01-07  right_only
3    닭개장(특) , 꽈배기    hyun  2025-01-07  right_only
4             닭개장   JERRY  2025-01-07  right_only
..            ...     ...         ...         ...
139          잔치국수   jiwon  2025-02-03  right_only
140         김치 찌개   jacob  2025-02-03  right_only
141          샌드위치  heejin  2025-02-03  right_only
142          제육볶음   lucas  2025-02-03        both
143          제육볶음    nuni  2025-02-03        both

[144 rows x 4 columns]

In [106]:
# _merge == right only 인것만 남기고
# _merge 컬럼은 지우고
diff_df = merge_df[merge_df['_merge'] == 'right only'].drop('_merge', axis=1)
diff_df

Empty DataFrame
Columns: [menu_name, name, dt]
Index: []

In [105]:
from pandasql import sqldf
query = """
SELECT df_jacob.menu_name, df_jacob.name
FROM df_jacob
LEFT JOIN df_lucas
ON df_jacob.menu_name = df_lucas.menu_name AND df_jacob.name = df_lucas.name 
WHERE df_lucas.menu_name IS NULL
"""

pysqldf2 = lambda q: sqldf(q,globals())

def pysqldf(q):
    sqldf(q,locals())

df_diff_a = sqldf(query, locals())
df_diff_a

    menu_name    name
0         컵라면     TOM
1       이면수구이     cho
2        스파게티   lucas
3         순대국     cho
4         닭개장    hyun
..        ...     ...
100       모다기     SEO
101        닭죽   jiwon
102      잔치국수   jacob
103     김치 찌개  heejin
104      샌드위치     TOM

[105 rows x 2 columns]

In [76]:
import pandas as pd

df1 = pd.DataFrame({"id": [1, 2, 3], "name": ["KIM", "MIN", "LEE"]})
df2 = pd.DataFrame({"id": [2, 3, 4, 5], "name": ["MIN", "LEE", "PARK", "TOM"]})
df3 = pd.DataFrame({"id": [5, 4, 2, 3], "name": ["TOM", "PARK","MIN", "LEE"]})

In [78]:
new_rows = []

for _, row_2 in df2.iterrows():
    is_match_row = False
    for _, row_1 in df1.iterrows():
        is_match_columns = True
        for c_name in df1.columns:
            if row_2[c_name] != row_1[c_name]:
                is_match_columns = False
                break
                
        if is_match_columns:
            is_match_row = True

    if not is_match_row:
        new_rows.append(row_2)
        
df_diff_2 = pd.DataFrame(new_rows)
df_diff_2

   id  name
2   4  PARK
3   5   TOM

In [79]:
merge_df_2 = pd.merge(df1, df3, how="right", indicator=True)

In [80]:
df_diff_3 = merge_df_2[merge_df_2['_merge'] == 'right_only'].drop('_merge', axis=1)
df_diff_3

   id  name
0   5   TOM
1   4  PARK

In [81]:
pd.merge(df1, df3, how="outer", indicator=False)

   id  name
0   1   KIM
1   2   MIN
2   3   LEE
3   4  PARK
4   5   TOM

In [82]:
from pandasql import sqldf
query = """
SELECT df2.id, df2.name
FROM df2
LEFT JOIN df1
ON df2.id = df1.id AND df2.name = df1.name 
WHERE df1.id IS NULL
"""

pysqldf2 = lambda q: sqldf(q,globals())

def pysqldf(q):
    sqldf(q,locals())

df_diff_1 = sqldf(query, locals())
df_diff_1

   id  name
0   4  PARK
1   5   TOM

In [66]:
## TODo
# df_diff_1, df_diff_2, df_diff_3 의 결과가 같은지 비교
df_diff_1.equals(df_diff_2)

False

In [67]:
df_diff_1.reset_index(drop=True).equals(df_diff_2.reset_index(drop=True))

True

In [83]:
df_diff_1.reset_index(drop=True).equals(df_diff_3.reset_index(drop=True))

False

In [84]:
df_diff_1.reset_index(drop=True)

   id  name
0   4  PARK
1   5   TOM

In [85]:
df_diff_3.reset_index(drop=True)

   id  name
0   5   TOM
1   4  PARK

In [86]:
df_diff_3.sort_values(by=['id','name']).reset_index(drop=True)

   id  name
0   4  PARK
1   5   TOM

In [87]:
df_diff_1.sort_values(by=['id','name']).reset_index(drop=True)

   id  name
0   4  PARK
1   5   TOM

In [90]:
df_diff_3.columns.tolist()

['id', 'name']

In [91]:
d3 = df_diff_3.sort_values(by=['id','name']).reset_index(drop=True)
d1 = df_diff_1.sort_values(by=['id','name']).reset_index(drop=True)
d3.equals(d1)

True